
import './App.css';
import { useDispatch, useSelector } from "react-redux"
import { useEffect } from "react";
import { Routes, Route, useNavigate } from "react-router-dom";
import HomeComp from './components/homepage';
import AllPlayersComp from './components/allPlayers';
import { addArrivedParticipantsFromExcel, addParticipantsFromExcel, addRoundFromExcel, addRoundResultsFromExcel, init, loadFromExcel } from './components/utils';
import TournamentComp from './components/tournament';

function App() {

  const dispatch = useDispatch()
//   const months = useSelector(state => state.months)
//   const roundsResults = [`אוראל ששון	אלי זילברשטיין	3	1
//   תומר נאמן	מרסל ינקו	0	3
//   אודי שפרן	יורי פרנקל	3	1
//   בוריס אורצקי	עמית שרר	1	3
//   אהרון שובל	סלבה חפץ	3	0
//   תומר מנדלס	שמעון בר אשר	2	3
//   יותם בר אשר	עידן אוחיון	2	3
//   אבי כהן	דניאל זיגלר	1	3
//   שמוליק כהן	שלמה ברזילאי	3	2
//   יואב זיידנברג	נתנאל ברוך	3	1
//   אולג שמואלוב	נתנאל ברוך	2	3
//   אבי כהן	מרסל ינקו	3	2
//   תומר מנדלס	חיים דניאל	1	3
//   שמעון בר אשר	תומר נאמן	3	2
//   דניאל זיגלר	שלמה ברזילאי	2	3
//   שמוליק כהן	אהרון שובל	3	2
//   סלבה חפץ	מיכאל פוקישנסקי	0	3
//   עמית שרר	עידו דוד	3	1
//   אולג שמואלוב	בוריס אורצקי	2	3
//   נתנאל ברוך	עידן אוחיון	3	1
//   אודי שפרן	אלי זילברשטיין	0	3
//   יורי פרנקל	אוראל ששון	0	3
//   יותם בר אשר	תומר נאמן	3	1
//   תומר מנדלס	מרסל ינקו	3	1
//   שמעון בר אשר	חיים דניאל	3	0
//   דניאל זיגלר	שמוליק כהן	2	3
//   אבי כהן	אהרון שובל	3	1
//   מיכאל פוקישנסקי	שלמה ברזילאי	3	1
//   עידו דוד	סלבה חפץ	1	3
//   נתנאל ברוך	אוראל ששון	0	3
//   אלי זילברשטיין	יורי פרנקל	3	2
//   עידן אוחיון	עמית שרר	1	3
//   אהרון שובל	אולג שמואלוב	3	0
//   ניר שרוני	שמעון בר אשר	2	3
//   אבי כהן	חיים דניאל	0	3
//   בוריס אורצקי	אודי שפרן	3	0
//   דניאל זיגלר	יותם בר אשר	3	1
//   תומר מנדלס	שמוליק כהן	3	1
//   אוראל ששון	מרסל ינקו	3	0
//   נתנאל ברוך	עמית שרר	1	3
//   שלמה ברזילאי	עידן אוחיון	1	3
//   עידו דוד	חיים דניאל	0	3
//   יותם בר אשר	אבי כהן	2	3
//   תומר מנדלס	דניאל זיגלר	0	3
//   עידן אוחיון	שמוליק כהן	1	3
//   אהרון שובל	אוראל ששון	1	3
//   מרסל ינקו	שמעון בר אשר	1	3
//   שמוליק כהן	עידו דוד	3	2
//   אולג שמואלוב	סלבה חפץ	3	2
//   עידן אוחיון	דניאל זיגלר	0	3`,
// `אולג שמואלוב	ירון טל	1	3
// אוראל ששון	סלבה חפץ	3	0
// יורי פרנקל	שי אברהם	1	3
// בוריס אורצקי	עידו דוד	3	1
// אהרון שובל	שלמה ברזילאי	2	3
// אבי כהן	תומר מנדלס	3	2
// אמיר ביבי	מרסל ינקו	3	1
// עידן אוחיון	תומר ביבי	3	2
// ניר שרוני	דניאל זיגלר	3	2
// יואב זיידנברג	שמעון בר אשר	2	3
// עמית שרר	תומר נאמן	3	2
// נתנאל ברוך	יורי פרנקל	3	1
// חיים דניאל	אודי שפרן	0	3
// יבגני גיללך	נתנאל ברוך	2	3
// אודי שפרן	מיכאל פוקישנסקי	1	3
// עידן אוחיון	אמיר ביבי	0	3
// עמית שרר	חיים דניאל	1	3
// תומר ביבי	שמעון בר אשר	3	1
// יואב זיידנברג	תומר נאמן	0	3
// אבי כהן	אוראל ששון	3	1
// סלבה חפץ	מרסל ינקו	2	3
// ירון טל	תומר מנדלס	3	1
// יואב זיידנברג	ניר שרוני	2	3
// דניאל זיגלר	אייל אורן	3	1
// שלמה ברזילאי	תומר נאמן	1	3
// אהרון שובל	אמיר ביבי	3	0
// עידו דוד	נתנאל ברוך	2	3
// עידן אוחיון	יבגני גיללך	1	3
// חיים דניאל	תומר ביבי	2	3
// מיכאל פוקישנסקי	ירון טל	3	2
// עמית שרר	אודי שפרן	3	1
// יובל זילבר	יורי פרנקל	3	0
// שמעון בר אשר	שלמה ברזילאי	3	2
// תומר מנדלס	יותם בר אשר	2	3
// אבי כהן	אייל אורן	1	3
// אוראל ששון	יואב זיידנברג	3	1
// תומר נאמן	אהרון שובל	3	0
// חיים דניאל	ניר שרוני	2	3
// שי אברהם	בוריס אורצקי	0	3
// שי אברהם	אמיר ביבי	1	3
// תומר ביבי	יבגני גיללך	0	3
// בוריס אורצקי	דניאל זיגלר	2	3
// עידו דוד	עידן אוחיון	3	1
// יובל זילבר	נתנאל ברוך	1	3
// ירון טל	יואב זיידנברג	1	3
// אוראל ששון	מיכאל פוקישנסקי	3	0
// סלבה חפץ	יורי פרנקל	1	3
// אהרון שובל	אודי שפרן	3	0
// תומר נאמן	תומר ביבי	1	3
// שמעון בר אשר	יבגני גיללך	1	3
// שלמה ברזילאי	אייל אורן	1	3
// עידו דוד	אבי כהן	3	1
// ירון טל	יותם בר אשר	2	3
// תומר מנדלס	יואב זיידנברג	3	1
// תומר נאמן	אמיר ביבי	3	1
// יובל זילבר	שי אברהם	3	2
// אודי שפרן	נתנאל ברוך	3	2
// אהרון שובל	חיים דניאל	3	1
// אוראל ששון	יבגני גיללך	2	3
// מיכאל פוקישנסקי	שמעון בר אשר	2	3
// בוריס אורצקי	תומר ביבי	1	3
// עידו דוד	דניאל זיגלר	0	3
// עידן אוחיון	מרסל ינקו	3	1
// אבי כהן	יואב זיידנברג	0	3
// אייל אורן	תומר מנדלס	3	1`,
// `עידו דוד	יורי פרנקל	3	0
// יותם בר אשר	עמית שרר	1	3
// ניר שרוני	אבי כהן	3	1
// עידן אוחיון	ירון טל	3	2
// תומר מנדלס	אוראל ששון	3	1
// אהרון שובל	יבגני גיללך	3	1
// מרסל ינקו	שלמה ברזילאי	3	2
// סלבה חפץ	תומר נאמן	2	3
// אמיר ביבי	חיים דניאל	3	0
// אייל אורן	תומר ביבי	0	3
// בוריס אורצקי	נתנאל ברוך	1	3
// אודי שפרן	שמעון בר אשר	2	3
// שמוליק כהן	יורי פרנקל	3	2
// עידן אוחיון	אהרון שובל	0	3
// יואב זיידנברג	עידו דוד	1	3
// אייל אורן	יואב זיידנברג	3	1
// אמיר ביבי	עידו דוד	1	3
// תומר ביבי	אבי כהן	3	2
// אוראל ששון	חיים דניאל	3	1
// תומר מנדלס	ניר שרוני	0	3
// שמוליק כהן	נתנאל ברוך	3	2
// בוריס אורצקי	יורי פרנקל	3	2
// שמעון בר אשר	ירון טל	0	3
// יבגני גיללך	אודי שפרן	3	1
// מיכאל פוקישנסקי	אולג שמואלוב	3	1
// מיכאל פוקישנסקי	יותם בר אשר	3	1
// אולג שמואלוב	שלמה ברזילאי	2	3
// עמית שרר	מרסל ינקו	3	0
// אייל אורן	עידו דוד	3	2
// יואב זיידנברג	אמיר ביבי	3	1
// תומר נאמן	נתנאל ברוך	1	3
// שמוליק כהן	סלבה חפץ	1	3
// תומר ביבי	ניר שרוני	3	1
// אלי זילברשטיין	תומר מנדלס	1	3
// אבי כהן	שמעון בר אשר	1	3
// אהרון שובל	ירון טל	0	3
// אוראל ששון	עידן אוחיון	3	1
// אמיר ביבי	אודי שפרן	3	1
// יבגני גיללך	יואב זיידנברג	2	3
// נתנאל ברוך	מרסל ינקו	1	3
// חיים דניאל	תומר נאמן	3	2
// יורי פרנקל	אולג שמואלוב	0	3
// שלמה ברזילאי	בוריס אורצקי	3	2
// דניאל זיגלר	עמית שרר	3	2
// יותם בר אשר	ניר שרוני	1	3
// מיכאל פוקישנסקי	אבי כהן	3	2
// שמעון בר אשר	אייל אורן	3	0
// ירון טל	תומר ביבי	0	3
// אלי זילברשטיין	אהרון שובל	2	3
// שמוליק כהן	אוראל ששון	3	1
// יבגני גיללך	סלבה חפץ	3	0
// אולג שמואלוב	חיים דניאל	0	3
// דניאל זיגלר	נתנאל ברוך	2	3
// יואב זיידנברג	עמית שרר	3	1
// תומר ביבי	תומר מנדלס	3	1
// ירון טל	אייל אורן	3	1
// אמיר ביבי	שמעון בר אשר	2	3
// מיכאל פוקישנסקי	יואב זיידנברג	1	3
// עמית שרר	אוראל ששון	2	3
// יותם בר אשר	שמוליק כהן	3	1
// אולג שמואלוב	תומר מנדלס	1	3
// אודי שפרן	אבי כהן	1	3
// חיים דניאל	מרסל ינקו	3	1
// דניאל זיגלר	יבגני גיללך	3	0
// נתנאל ברוך	שמעון בר אשר	0	3`,
// `שי אברהם	אהרון שובל	1	3
// עידן אוחיון	אבי כהן	2	3
// שמוליק כהן	ירון טל	1	3
// מרסל ינקו	יורי פרנקל	0	3
// סלבה חפץ	ניר שרוני	3	2
// עמית שרר	שלמה ברזילאי	3	2
// אוראל ששון	יותם בר אשר	0	3
// בוריס אורצקי	תומר מנדלס	2	3
// אמיר ביבי	דניאל זיגלר	3	2
// תומר ביבי	יואב זיידנברג	3	0
// חיים דניאל	יובל זילבר	3	2
// מיכאל פוקישנסקי	תומר ביבי	1	3
// יואב זיידנברג	יותם בר אשר	2	3
// אוראל ששון	שי אברהם	2	3
// אהרון שובל	דניאל זיגלר	1	3
// אמיר ביבי	שמוליק כהן	2	3
// אודי שפרן	תומר נאמן	3	1
// שלמה ברזילאי	יורי פרנקל	3	0
// תומר ביבי	עמית שרר	2	3
// אייל אורן	מיכאל פוקישנסקי	3	0
// ניר שרוני	ירון טל	0	3
// אודי שפרן	יובל זילבר	3	2
// שמעון בר אשר	עידן אוחיון	3	2
// אבי כהן	בוריס אורצקי	3	1
// חיים דניאל	סלבה חפץ	3	1
// דניאל זיגלר	מרסל ינקו	3	1
// אהרון שובל	תומר מנדלס	1	3
// שי אברהם	יותם בר אשר	2	3
// אמיר ביבי	אוראל ששון	0	3
// יואב זיידנברג	שלמה ברזילאי	3	1
// שמוליק כהן	תומר ביבי	3	2
// מיכאל פוקישנסקי	יורי פרנקל	3	0
// ניר שרוני	אייל אורן	3	1
// ירון טל	עמית שרר	3	2
// מרסל ינקו	בוריס אורצקי	1	3
// יובל זילבר	אבי כהן	3	1
// שמעון בר אשר	דניאל זיגלר	0	3
// עידן אוחיון	סלבה חפץ	1	3
// אבי כהן	שלמה ברזילאי	3	1
// חיים דניאל	יואב זיידנברג	0	3
// אמיר ביבי	תומר מנדלס	3	2
// אהרון שובל	יותם בר אשר	3	2
// שי אברהם	תומר ביבי	2	3
// שמוליק כהן	יובל זילבר	2	3
// אודי שפרן	ניר שרוני	3	2
// ירון טל	דניאל זיגלר	1	3
// יורי פרנקל	שמעון בר אשר	0	3
// עמית שרר	מיכאל פוקישנסקי	1	3
// שלמה ברזילאי	שי אברהם	0	3
// שמעון בר אשר	בוריס אורצקי	1	3
// אייל אורן	חיים דניאל	2	3
// שי אברהם	מרסל ינקו	2	3
// תומר מנדלס	עמית שרר	2	3
// דניאל זיגלר	אודי שפרן	3	1
// ירון טל	יובל זילבר	3	2`,
// `מרסל ינקו	אודי שפרן	3	0
// שי אברהם	עמית שרר	1	3
// יובל זילבר	סלבה חפץ	3	1
// יותם בר אשר	בוריס אורצקי	3	0
// יורי פרנקל	אהרון שובל	3	0
// יואב זיידנברג	עידן אוחיון	1	3
// שמוליק כהן	ניר שרוני	2	3
// נתנאל ברוך	אבי כהן	0	3
// אייל אורן	אוראל ששון	3	1
// מיכאל פוקישנסקי	דניאל זיגלר	3	0
// תומר מנדלס	נתנאל ברוך	2	3
// שמוליק כהן	שמעון בר אשר	1	3
// עידן אוחיון	ניר שרוני	2	3
// יואב זיידנברג	בוריס אורצקי	3	1
// יורי פרנקל	יותם בר אשר	3	2
// אייל אורן	אהרון שובל	3	0
// שי אברהם	מיכאל פוקישנסקי	3	0
// עמית שרר	יובל זילבר	0	3
// נתנאל ברוך	סלבה חפץ	2	3
// אוראל ששון	דניאל זיגלר	1	3
// אהרון שובל	מרסל ינקו	3	2
// תומר מנדלס	אודי שפרן	2	3
// אבי כהן	שי אברהם	0	3
// בוריס אורצקי	מיכאל פוקישנסקי	3	0
// יואב זיידנברג	יובל זילבר	3	2
// עמית שרר	אייל אורן	1	3
// יורי פרנקל	ניר שרוני	3	2
// שמעון בר אשר	אוראל ששון	1	3
// יובל זילבר	יותם בר אשר	1	3
// שי אברהם	דניאל זיגלר	1	3
// אייל אורן	עידן אוחיון	2	3
// שמוליק כהן	יואב זיידנברג	1	3
// אבי כהן	סלבה חפץ	3	1
// ניר שרוני	עמית שרר	3	1
// אוראל ששון	בוריס אורצקי	3	0
// מיכאל פוקישנסקי	נתנאל ברוך	3	1
// שמעון בר אשר	שי אברהם	3	1
// יואב זיידנברג	אודי שפרן	3	1
// תומר מנדלס	יובל זילבר	2	3
// אייל אורן	יותם בר אשר	2	3
// מרסל ינקו	שמוליק כהן	2	3
// שי אברהם	נתנאל ברוך	2	3
// אוראל ששון	אודי שפרן	3	2`,
// `אודי שפרן	שי אברהם	3	2
// אהרון שובל	נתנאל ברוך	3	2
// בוריס אורצקי	סלבה חפץ	3	1
// עידו דוד	מרסל ינקו	3	1
// יורי פרנקל	עמית שרר	1	3
// תומר ביבי	דניאל זיגלר	3	0
// ירון טל	אמיר ביבי	3	1
// שמעון בר אשר	עידו דוד	3	1
// עמית שרר	שמוליק כהן	2	3
// דניאל זיגלר	יורי פרנקל	3	1
// מרסל ינקו	תומר ביבי	2	3
// ניר שרוני	אמיר ביבי	2	3
// ירון טל	נתנאל ברוך	3	2
// סלבה חפץ	שי אברהם	3	1
// אודי שפרן	תומר ביבי	2	3
// ירון טל	עידו דוד	3	1
// שמעון בר אשר	עמית שרר	3	0
// נתנאל ברוך	אמיר ביבי	3	2
// ניר שרוני	מרסל ינקו	3	2
// אודי שפרן	שמוליק כהן	2	3
// יורי פרנקל	תומר ביבי	3	1
// דניאל זיגלר	סלבה חפץ	3	2
// ניר שרוני	עידו דוד	3	2
// יורי פרנקל	ירון טל	1	3
// אהרון שובל	בוריס אורצקי	2	3
// אהרון שובל	שמעון בר אשר	2	3
// אמיר ביבי	בוריס אורצקי	2	3
// תומר ביבי	נתנאל ברוך	1	3
// שי אברהם	שמוליק כהן	3	0
// ירון טל	אודי שפרן	3	1
// ניר שרוני	נתנאל ברוך	3	2
// עידו דוד	אהרון שובל	3	1`]

  useEffect(() => {
    async function initData(){
      // const tourId = "8GIOyB0NTxxUIjcAUsRR"
      // await addParticipantsFromExcel(tourId)
      // for (const [index, results] of roundsResults.entries()) {
      //   await addRoundResultsFromExcel(tourId, months, index + 1, results)
      // }
      await init(dispatch)
    }
    initData()
  },[])

  return (
    <div className="App">
      <Routes>
        <Route path='/' element={<HomeComp></HomeComp>}></Route>
        <Route path='/tournament/:id' element={<TournamentComp></TournamentComp>}></Route>
        <Route path='/players' element={<AllPlayersComp></AllPlayersComp>}></Route>
      </Routes>
    </div>
  );
}

export default App;
